      * Simple "hello world" in COBOL

       IDENTIFICATION DIVISION.
       PROGRAM-ID.  HelloWorld.

       PROCEDURE DIVISION.
       DisplayGreeting.
          DISPLAY "Hello world".
          STOP RUN.
                   
